# ***PRATICANDO 2***

* Inserir os novos títulos no banco de dados
* Alterar o valor dos jogos em promoção.
* Criar uma tabela chamada promoção e inserir os jogos 
em promoção na tabela criada.
* Uma forma de selecionar o nome do jogo, o valor e o 
nome da seção dos títulos em promoção.
* Uma forma de selecionar o nome dos títulos e seus 
respectivos valores, que não estejam em promoção.

In [ ]:
CREATE database if not exists play;
use play;

--------------- DDL - CRIANDO TABELAS -------------

create table if not exists jogo(
    id int not null AUTO_INCREMENT PRIMARY key,
    nome varchar(40) not null,
    valor decimal(6,2),
    id_secao int),
    data_lancamento DATE,
    foreign (id_secao) references secao(id);
    
create table if not exists promocao(
    id_promo int not null AUTO_INCREMENT PRIMARY KEY,
    nome varchar(40),
    id_jogo int, 
    promocao VARCHAR (40),
    Foreign Key (id_jogo) REFERENCES jogo(id));


create table if not exists secao(
    id int AUTO_INCREMENT PRIMARY KEY,
    nome VARCHAR (40));

create table if not exists valor_jogos(
    id_jogo int PRIMARY key,
    valor_original decimal(6,2),
    Foreign Key (id_jogo) REFERENCES jogo(id));

--------------- DML - INSERINDO DADOS ------------------

insert into jogo values
    (0,'CTR', 250.00, 1, 2024-09-01),
    (0,'Donkey Monkey Country 4', 300.00, 4, 2023-10-15),
    (0,'Horizonte Esquecido Oeste', 150.00, 3, 2022-11-20),
    (0,'Final Costume XX', 299.00, 3, 2021-12-05),
    (0,'A sombra do colosso', 200.00, 3, 1980-12-12),
    (0, 'NFS U2 Remake', 300.00, 1, 1981-12-12),
    (0,'PES-13', 999.00, 2, 2020-12-05),
    (0,'FIFA-13', 99.00, 2, 2019-12-05);

insert into valor_jogos values
    (1, 250.00),
    (2, 300.00),
    (3, 150.00),
    (4, 299.00),
    (5, 200.00),
    (6, 300.00),
    (7, 999.00),
    (8, 99.00);

INSERT INTO promocao (nome, id_jogo)
    SELECT jogo.nome, jogo.id FROM jogo
    WHERE jogo.data_lancamento < '2000-01-01';


INSERT into secao VALUES
    (0, 'Corrida'),
    (0, 'Futebol'),
    (0, 'Guerra'),
    (0, 'Outros');

------- DML - ATUALIZA VALOR COM 50% DESCONTO, DE JOGOS QUE ESTÃO NA TABELA PROMOÇÃO -----------
UPDATE jogo
    set valor = valor * 0.5
    where jogo.id in 
    (SELECT promocao.id_jogo from promocao);

------- DML - ATULIZA JOGOS PARA O VALOR ORIGINAL SOMENTE DOS JOGOS QUE ESÃO EMPROMOÇÃO -------
START TRANSACTION;
UPDATE jogo INNER JOIN valor_jogos 
    ON jogo.id = valor_jogos.id_jogo
SET jogo.valor = valor_jogos.valor_original
    WHERE jogo.id IN (SELECT id_jogo FROM promocao);
ROLLBACK;
COMMIT;

--------------- DQL - CONSULTANDO ------------------
SELECT * from jogo;
SELECT * from promocao;
SELECT * from secao;
SELECT * from valor_jogos;

-------------- RETORNA TODOS OS JOGO, COMO O NOME DA PROMOCAO SE EXISTIR --------
SELECT
    jogo.id, jogo.nome,
    jogo.valor, promocao.promocao 
from jogo LEFT join promocao
on jogo.id = promocao.id_jogo;

-------------- RETORNA SOMENTE OS JOGO COM PROMOCAO ---------------
select 
    jogo.id as Cod,
    jogo.nome as Jogo,
    jogo.valor, promocao.nome as Promoção 
from jogo inner join promocao
    on jogo.id = promocao.id_jogo
where jogo.id in
    (select promocao.id_jogo from promocao);

-------------- RETORNA SOMENTE JOGOS SEM PROMOÇÃO ----------------
select 
jogo.id as Cód,
jogo.nome as Jogo,
jogo.valor
from jogo
where jogo.id not in 
    (select promocao.id_jogo from promocao);